In [43]:
import pandas as pd

In [44]:
bike = pd.read_csv("bike.csv")
bike.head(2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40

In [45]:
qua_1 = bike["casual"].quantile(0.25)
qua_1

4.0

In [46]:
qua_3 = bike["casual"].quantile(0.75)
qua_3

49.0

In [47]:
stat_iqr = qua_3 - qua_1
stat_iqr

45.0

In [48]:
sum(bike["casual"] > qua_3 + 1.5 * stat_iqr)

749

In [49]:
qua_1 = bike["count"].quantile(0.25)
qua_1

42.0

In [50]:
qua_3 = bike["count"].quantile(0.75)
qua_3

284.0

In [51]:
stat_iqr = qua_3 - qua_1
stat_iqr

242.0

In [52]:
ub = qua_3 + 1.5 * stat_iqr
ub

647.0

In [53]:
lb = qua_1 - 1.5 * stat_iqr
lb

-321.0

In [54]:
lb_1 = bike["count"] < lb
lb_1

0        False
1        False
2        False
3        False
4        False
         ...
10881    False
10882    False
10883    False
10884    False
10885    False
Name: count, Length: 10886, dtype: bool

In [55]:
condi_1 = bike["count"] < (lb)
condi_2 = bike["count"] > (ub)
bike_out = bike.loc[condi_1 | condi_2, ]
print(len(bike_out))
bike_out.head()

300

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
6611,2012-03-12 18:00:00,1,0,1,2,24.60,31.06,43,12.9980,89,623,712
6634,2012-03-13 17:00:00,1,0,1,1,28.70,31.82,37,7.0015,62,614,676
6635,2012-03-13 18:00:00,1,0,1,1,28.70,31.82,34,19.9995,96,638,734
6649,2012-03-14 08:00:00,1,0,1,1,18.04,21.97,82,0.0000,34,628,662
6658,2012-03-14 17:00:00,1,0,1,1,28.70,31.82,28,6.0032,140,642,782

In [57]:
condi_1 = bike["count"] >= (lb)
condi_2 = bike["count"] <= (ub)
bike_in = bike.loc[condi_1 & condi_2, ]
print(len(bike_in))
bike_in.head()

10586

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [58]:
bike["casual"].kurt()

7.551629305632764

In [59]:
bike["casual"].skew()

2.4957483979812567

In [60]:
bike.kurt(numeric_only = True)

season        -1.355661
holiday       30.046975
workingday    -1.397828
weather        0.395533
temp          -0.914530
atemp         -0.850076
humidity      -0.759818
windspeed      0.630133
casual         7.551629
registered     2.626081
count          1.300093
dtype: float64

In [66]:
help(bike.kurt)

Help on method kurt in module pandas.core.generic:

kurt(axis=None, skipna=None, level=None, numeric_only=None, **kwargs) method of pandas.core.frame.DataFrame instance
    Return unbiased kurtosis over requested axis.

    Kurtosis obtained using Fisher's definition of
    kurtosis (kurtosis of normal == 0.0). Normalized by N-1.

    Parameters
    ----------
    axis : {index (0), columns (1)}
        Axis for the function to be applied on.
    skipna : bool, default True
        Exclude NA/null values when computing the result.
    level : int or level name, default None
        If the axis is a MultiIndex (hierarchical), count along a
        particular level, collapsing into a Series.
    numeric_only : bool, default None
        Include only float, int, boolean columns. If None, will attempt to use
        everything, then use only numeric data. Not implemented for Series.
    **kwargs
        Additional keyword arguments to be passed to the function.

    Returns
    -------
    Series or DataFrame (if level specified)

In [71]:
bike_sub = bike[["temp", "atemp", "casual", "registered"]]
bike_sub.head(2)

   temp   atemp  casual  registered
0  9.84  14.395       3          13
1  9.02  13.635       8          32

In [72]:
bike_sub.corr()

                temp     atemp    casual  registered
temp        1.000000  0.984948  0.467097    0.318571
atemp       0.984948  1.000000  0.462067    0.314635
casual      0.467097  0.462067  1.000000    0.497250
registered  0.318571  0.314635  0.497250    1.000000

In [73]:
bike_sub.corr(method = "kendall")

                temp     atemp    casual  registered
temp        1.000000  0.955043  0.413319    0.240250
atemp       0.955043  1.000000  0.410275    0.237979
casual      0.413319  0.410275  1.000000    0.582213
registered  0.240250  0.237979  0.582213    1.000000

In [74]:
bike_sub.corr(method = "spearman")

                temp     atemp    casual  registered
temp        1.000000  0.987128  0.573034    0.352174
atemp       0.987128  1.000000  0.571588    0.350577
casual      0.573034  0.571588  1.000000    0.775785
registered  0.352174  0.350577  0.775785    1.000000

In [75]:
bike_sub.corr().round(2)

            temp  atemp  casual  registered
temp        1.00   0.98    0.47        0.32
atemp       0.98   1.00    0.46        0.31
casual      0.47   0.46    1.00        0.50
registered  0.32   0.31    0.50        1.00

In [76]:
from scipy.stats import pearsonr
from scipy.stats import spearmanr
from scipy.stats import kendalltau

In [77]:
stat, p = pearsonr(bike_sub["temp"], bike_sub["casual"])
print(stat)
print(p)

0.4670970641201307
0.0

In [78]:
dia = pd.read_csv("diamonds.csv")
dia.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [79]:
dia_E = dia.loc[dia["color"] == "E"]
dia_H = dia.loc[dia["color"] == "H"]

In [80]:
print(len(dia_E))
print(len(dia_H))

9797
8304

In [81]:
from scipy.stats import bartlett
bartlett(dia_E["price"], dia_H["price"])

BartlettResult(statistic=484.16407135967086, pvalue=2.6525226756537817e-107)

In [82]:
stat, p = bartlett(dia_E["price"], dia_H["price"])
print(stat)
print(p)

484.16407135967086
2.6525226756537817e-107

In [85]:
round(abs(stat), 5)

484.16407

In [84]:
round(abs(p), 2)

0.0

In [87]:
from scipy.stats import chi2_contingency
df = pd.read_csv("traffic_accident.txt", sep = "\t")
df.head(2)

   seq sex serious_yn  age
0    1   M          N    3
1    2   M          N    6

In [88]:
chi2_contingency(pd.crosstab(df["serious_yn"], df["sex"]))

(3.7895026717172966,
 0.051574970410524265,
 1,
 array([[286.99343955, 679.00656045],
        [ 30.00656045,  70.99343955]]))

In [90]:
chi2_contingency(pd.crosstab(df["serious_yn"], df["sex"]), correction = False)

(4.248074934656112,
 0.03929484927552679,
 1,
 array([[286.99343955, 679.00656045],
        [ 30.00656045,  70.99343955]]))

In [91]:
chi2_contingency(pd.crosstab(df["serious_yn"], df["age"]))

(9.410466679276956,
 0.051619825959927854,
 4,
 array([[193.74320525, 199.17525773, 209.13402062, 186.5004686 ,
         177.4470478 ],
        [ 20.25679475,  20.82474227,  21.86597938,  19.4995314 ,
          18.5529522 ]]))

In [113]:
import pandas as pd
df = pd.read_csv("bank.csv", sep = ";")
df.head(2)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no

In [114]:
df["age"].min()

19

In [115]:
df["age"].max()

87

In [116]:
import math

In [117]:
math.floor(3.6)

3

In [118]:
df["age"]/10

0       3.0
1       3.3
2       3.5
3       3.0
4       5.9
       ...
4516    3.3
4517    5.7
4518    5.7
4519    2.8
4520    4.4
Name: age, Length: 4521, dtype: float64

In [127]:
df["age_1"] = df["age"]//10
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,age_1
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,3
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,3
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,3
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,3
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,5

In [121]:
stat, p = pearsonr(df["age"], df["balance"])
print(stat)
print(p) # 상관관계가 있다

0.08382014224477766
1.658480874647685e-08

In [125]:
chi2_contingency(pd.crosstab(df["marital"], df["y"]))
# 독립이 아니다

(19.03005634409817,
 7.373535401823763e-05,
 2,
 array([[ 467.15328467,   60.84671533],
        [2474.67374475,  322.32625525],
        [1058.17297058,  137.82702942]]))

In [128]:
from scipy.stats import ttest_1samp

In [129]:
df = pd.read_excel("iris_xlsx.xlsx")
df.head(2)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [136]:
stat, p = ttest_1samp(df["Sepal.Length"], popmean = 5.75)
print(stat)
print(p)

1.3804395261164213
0.16951878249006963

In [131]:
df["Sepal.Length"].mean()

5.843333333333335

In [137]:
from scipy.stats import ttest_rel
from scipy.stats import ttest_ind

In [138]:
ttest_rel(df["Sepal.Length"], df["Sepal.Width"])

Ttest_relResult(statistic=34.81519257082818, pvalue=1.8495537347987982e-73)

In [139]:
ttest_ind(df["Sepal.Length"], df["Sepal.Width"], equal_var = True)

Ttest_indResult(statistic=36.463283934449116, pvalue=7.027919392009369e-112)

In [140]:
ttest_ind(df["Sepal.Length"], df["Sepal.Width"], equal_var = False)

Ttest_indResult(statistic=36.46328393444912, pvalue=1.4595425075861685e-96)

In [142]:
stat, p = ttest_ind(df["Sepal.Width"], df["Sepal.Length"])
print(stat)
print(round(abs(stat), 2))

-36.463283934449116
36.46

In [143]:
import pandas as pd
from scipy.stats import f_oneway
df = pd.read_excel("iris_xlsx.xlsx")
stat, p = f_oneway(df["Sepal.Length"], df["Sepal.Width"], df["Petal.Length"])

In [145]:
import pandas as pd
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm
df = pd.read_csv("diamonds.csv")
formula = "price ~ C(cut)"
lm = ols(formula, df).fit()
print(anova_lm(lm))

               df        sum_sq       mean_sq           F         PR(>F)
C(cut)        4.0  1.104175e+10  2.760436e+09  175.688717  8.428307e-150
Residual  53935.0  8.474314e+11  1.571209e+07         NaN            NaN

In [147]:
bike = pd.read_csv("bike.csv")
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [150]:
lm1 = ols("temp ~ season", bike).fit()
anova_lm(lm1)

               df         sum_sq       mean_sq           F         PR(>F)
season        1.0   44221.657301  44221.657301  780.591754  5.879560e-166
Residual  10884.0  616594.417651     56.651453         NaN            NaN

In [149]:
lm2 = ols("temp ~ C(season)", bike).fit()
anova_lm(lm2)

                df         sum_sq        mean_sq            F  PR(>F)
C(season)      3.0  412885.270005  137628.423335  6040.687453     0.0
Residual   10882.0  247930.804947      22.783570          NaN     NaN

In [151]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [153]:
dia = pd.read_csv("diamonds.csv")
posthoc = pairwise_tukeyhsd(df["price"], df["cut"])
print(posthoc)

     Multiple Comparison of Means - Tukey HSD, FWER=0.05
==============================================================
 group1   group2   meandiff p-adj    lower      upper   reject
--------------------------------------------------------------
   Fair      Good -429.8933 0.0015  -740.4567 -119.3299   True
   Fair     Ideal -901.2158  0.001 -1180.5785 -621.8531   True
   Fair   Premium  225.4999  0.195   -59.2739  510.2738  False
   Fair Very Good -376.9979 0.0031  -663.8694  -90.1263   True
   Good     Ideal -471.3225  0.001   -642.367 -300.2779   True
   Good   Premium  655.3933  0.001   475.6466  835.1399   True
   Good Very Good   52.8954    0.9  -130.1565  235.9474  False
  Ideal   Premium 1126.7157  0.001  1008.8058 1244.6257   True
  Ideal Very Good  524.2179  0.001   401.3281  647.1078   True
Premium Very Good -602.4978  0.001  -737.2366 -467.7591   True
--------------------------------------------------------------